In [2]:
import pandas as ps

In [3]:
df = [['Faiz',19,25000],
      ['Khanif',29,50000],
       ['Rahul',31,40000]]

data = ps.DataFrame(df,columns = ['Name','Age','Salary'])

In [4]:
data

     Name  Age  Salary
0    Faiz   19   25000
1  Khanif   29   50000
2   Rahul   31   40000

In [5]:
data['Joining Age']=[19,21,22]

In [6]:
data

     Name  Age  Salary  Joining Age
0    Faiz   19   25000           19
1  Khanif   29   50000           21
2   Rahul   31   40000           22

In [7]:
data.drop(columns=['Joining Age'], inplace = False)

     Name  Age  Salary
0    Faiz   19   25000
1  Khanif   29   50000
2   Rahul   31   40000

In [8]:
data

     Name  Age  Salary  Joining Age
0    Faiz   19   25000           19
1  Khanif   29   50000           21
2   Rahul   31   40000           22

In [9]:
data['Emp_id'] = [100,101,102]
data=data.set_index('Emp_id')

In [10]:
data

          Name  Age  Salary  Joining Age
Emp_id
100       Faiz   19   25000           19
101     Khanif   29   50000           21
102      Rahul   31   40000           22

In [15]:
data=data.reset_index('Emp_id')

In [16]:
data

   Emp_id    Name  Age  Salary  Joining Age
0     100    Faiz   19   25000           19
1     101  Khanif   29   50000           21
2     102   Rahul   31   40000           22

In [17]:
data = data.set_index(['Emp_id','Name'])

In [18]:
data

               Age  Salary  Joining Age
Emp_id Name
100    Faiz     19   25000           19
101    Khanif   29   50000           21
102    Rahul    31   40000           22